Autodesk.Revit.DB.ImageExportOptions.SetViewsAndSheets(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Sets a list of views and sheets to be exported.  Used only when ExportRange is SetOfViews.
viewsAndSheets:
The ids of the views and sheets.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ImageExportOptions.GetFileName(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the file name that will be produced when exporting a view to an image.
aDoc:
The document that owns the view.
dbViewId:
View which is to be exported as image.
Returns:
The generated exported image file name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ImageExportOptions.IsValidFileName(System.String)
Verify if File name is valid
filePath:
File path to be tested for valid file name
Returns:
True if File name is valid; false otherwise
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ImageExportOptions.IsValidForSaveToProjectAsImage(Autodesk.Revit.DB.ImageExportOptions,Autodesk.Revit.DB.Document)
Verify if ImageExportOptions object is valid for calling saveToProjectAsImage
options:
ImageExportOptions object to be validated
doc:
Document for view name verification
Returns:
True if ImageExportOptions object is valid for calling saveToProjectAsImage; false otherwise
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ImageExportOptions.FilePath
The file name and path for the exported file.
Remarks:
If ExportRange is SetOfViews, the name of each view or sheet will be
appended to the name provided for each exported file.
This field is ignored if used to save an image to a project as a new view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input file path is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ImageExportOptions.ViewName
The name of the view to be created.
Remarks:
This field is used only to save an image to a project as a new view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011